MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ128GP802/mcu.h
#define _DMACS0_XWCOL6_POSITION                  0x00000006
#define _DMACS0_XWCOL6_MASK                      0x00000040
#define _DMACS0_XWCOL6_LENGTH                    0x00000001

#define _DMACS0_XWCOL7_POSITION                  0x00000007
#define _DMACS0_XWCOL7_MASK                      0x00000080
#define _DMACS0_XWCOL7_LENGTH                    0x00000001

#define _DMACS0_PWCOL0_POSITION                  0x00000008
#define _DMACS0_PWCOL0_MASK                      0x00000100
#define _DMACS0_PWCOL0_LENGTH                    0x00000001

#define _DMACS0_PWCOL1_POSITION                  0x00000009
#define _DMACS0_PWCOL1_MASK                      0x00000200
#define _DMACS0_PWCOL1_LENGTH                    0x00000001

#define _DMACS0_PWCOL2_POSITION                  0x0000000A
#define _DMACS0_PWCOL2_MASK                      0x00000400
#define _DMACS0_PWCOL2_LENGTH                    0x00000001

#define _DMACS0_PWCOL3_POSITION                  0x0000000B
#define _DMACS0_PWCOL3_MASK                      0x00000800
#define _DMACS0_PWCOL3_LENGTH                    0x00000001

#define _DMACS0_PWCOL4_POSITION                  0x0000000C
#define _DMACS0_PWCOL4_MASK                      0x00001000
#define _DMACS0_PWCOL4_LENGTH                    0x00000001

#define _DMACS0_PWCOL5_POSITION                  0x0000000D
#define _DMACS0_PWCOL5_MASK                      0x00002000
#define _DMACS0_PWCOL5_LENGTH                    0x00000001

#define _DMACS0_PWCOL6_POSITION                  0x0000000E
#define _DMACS0_PWCOL6_MASK                      0x00004000
#define _DMACS0_PWCOL6_LENGTH                    0x00000001

#define _DMACS0_PWCOL7_POSITION                  0x0000000F
#define _DMACS0_PWCOL7_MASK                      0x00008000
#define _DMACS0_PWCOL7_LENGTH                    0x00000001

#define _DMACS1_PPST0_POSITION                   0x00000000
#define _DMACS1_PPST0_MASK                       0x00000001
#define _DMACS1_PPST0_LENGTH                     0x00000001

#define _DMACS1_PPST1_POSITION                   0x00000001
#define _DMACS1_PPST1_MASK                       0x00000002
#define _DMACS1_PPST1_LENGTH                     0x00000001

#define _DMACS1_PPST2_POSITION                   0x00000002
#define _DMACS1_PPST2_MASK                       0x00000004
#define _DMACS1_PPST2_LENGTH                     0x00000001

#define _DMACS1_PPST3_POSITION                   0x00000003
#define _DMACS1_PPST3_MASK                       0x00000008
#define _DMACS1_PPST3_LENGTH                     0x00000001

#define _DMACS1_PPST4_POSITION                   0x00000004
#define _DMACS1_PPST4_MASK                       0x00000010
#define _DMACS1_PPST4_LENGTH                     0x00000001

#define _DMACS1_PPST5_POSITION                   0x00000005
#define _DMACS1_PPST5_MASK                       0x00000020
#define _DMACS1_PPST5_LENGTH                     0x00000001

#define _DMACS1_PPST6_POSITION                   0x00000006
#define _DMACS1_PPST6_MASK                       0x00000040
#define _DMACS1_PPST6_LENGTH                     0x00000001

#define _DMACS1_PPST7_POSITION                   0x00000007
#define _DMACS1_PPST7_MASK                       0x00000080
#define _DMACS1_PPST7_LENGTH                     0x00000001

#define _DMACS1_LSTCH_POSITION                   0x00000008
#define _DMACS1_LSTCH_MASK                       0x00000F00
#define _DMACS1_LSTCH_LENGTH                     0x00000004

#define _DMACS1_PPST_POSITION                    0x00000000
#define _DMACS1_PPST_MASK                        0x000000FF
#define _DMACS1_PPST_LENGTH                      0x00000008

#define _DMACS1_LSTCH0_POSITION                  0x00000008
#define _DMACS1_LSTCH0_MASK                      0x00000100
#define _DMACS1_LSTCH0_LENGTH                    0x00000001

#define _DMACS1_LSTCH1_POSITION                  0x00000009
#define _DMACS1_LSTCH1_MASK                      0x00000200
#define _DMACS1_LSTCH1_LENGTH                    0x00000001

#define _DMACS1_LSTCH2_POSITION                  0x0000000A
#define _DMACS1_LSTCH2_MASK                      0x00000400
#define _DMACS1_LSTCH2_LENGTH                    0x00000001

#define _DMACS1_LSTCH3_POSITION                  0x0000000B
#define _DMACS1_LSTCH3_MASK                      0x00000800
#define _DMACS1_LSTCH3_LENGTH                    0x00000001

#define _DAC1CON_DACFDIV_POSITION                0x00000000
#define _DAC1CON_DACFDIV_MASK                    0x0000007F
#define _DAC1CON_DACFDIV_LENGTH                  0x00000007

#define _DAC1CON_FORM_POSITION                   0x00000008
#define _DAC1CON_FORM_MASK                       0x00000100
#define _DAC1CON_FORM_LENGTH                     0x00000001

#define _DAC1CON_AMPON_POSITION                  0x0000000C
#define _DAC1CON_AMPON_MASK                      0x00001000
#define _DAC1CON_AMPON_LENGTH                    0x00000001

#define _DAC1CON_DACSIDL_POSITION                0x0000000D
#define _DAC1CON_DACSIDL_MASK                    0x00002000
#define _DAC1CON_DACSIDL_LENGTH                  0x00000001

#define _DAC1CON_DACEN_POSITION                  0x0000000F
#define _DAC1CON_DACEN_MASK                      0x00008000
#define _DAC1CON_DACEN_LENGTH                    0x00000001

#define _DAC1CON_DACFDIV0_POSITION               0x00000000
#define _DAC1CON_DACFDIV0_MASK                   0x00000001
#define _DAC1CON_DACFDIV0_LENGTH                 0x00000001

#define _DAC1CON_DACFDIV1_POSITION               0x00000001
#define _DAC1CON_DACFDIV1_MASK                   0x00000002
#define _DAC1CON_DACFDIV1_LENGTH                 0x00000001

#define _DAC1CON_DACFDIV2_POSITION               0x00000002
#define _DAC1CON_DACFDIV2_MASK                   0x00000004
#define _DAC1CON_DACFDIV2_LENGTH                 0x00000001

#define _DAC1CON_DACFDIV3_POSITION               0x00000003
#define _DAC1CON_DACFDIV3_MASK                   0x00000008
#define _DAC1CON_DACFDIV3_LENGTH                 0x00000001

#define _DAC1CON_DACFDIV4_POSITION               0x00000004
#define _DAC1CON_DACFDIV4_MASK                   0x00000010
#define _DAC1CON_DACFDIV4_LENGTH                 0x00000001

#define _DAC1CON_DACFDIV5_POSITION               0x00000005
#define _DAC1CON_DACFDIV5_MASK                   0x00000020
#define _DAC1CON_DACFDIV5_LENGTH                 0x00000001

#define _DAC1CON_DACFDIV6_POSITION               0x00000006
#define _DAC1CON_DACFDIV6_MASK                   0x00000040
#define _DAC1CON_DACFDIV6_LENGTH                 0x00000001

#define _DAC1STAT_REMPTY_POSITION                0x00000000
#define _DAC1STAT_REMPTY_MASK                    0x00000001
#define _DAC1STAT_REMPTY_LENGTH                  0x00000001

#define _DAC1STAT_RFULL_POSITION                 0x00000001
#define _DAC1STAT_RFULL_MASK                     0x00000002
#define _DAC1STAT_RFULL_LENGTH                   0x00000001

#define _DAC1STAT_RITYPE_POSITION                0x00000002
#define _DAC1STAT_RITYPE_MASK                    0x00000004
#define _DAC1STAT_RITYPE_LENGTH                  0x00000001

#define _DAC1STAT_RMVOEN_POSITION                0x00000005
#define _DAC1STAT_RMVOEN_MASK                    0x00000020
#define _DAC1STAT_RMVOEN_LENGTH                  0x00000001

#define _DAC1STAT_ROEN_POSITION                  0x00000007
#define _DAC1STAT_ROEN_MASK                      0x00000080
#define _DAC1STAT_ROEN_LENGTH                    0x00000001

